# Taps
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
# tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mas' # Mac App Store manager
brew 'uv' # package manager for python
brew 'tailscale' # Tailscale networking

# Developer Apps
cask 'visual-studio-code'
cask 'postman'
cask 'slack'
cask 'claude-code'

# Browser Apps
cask 'brave-browser'
cask 'google-chrome'

# Personal Apps
cask 'gimp'
cask 'obs'
cask 'notion'
cask 'discord'
cask 'steam'
cask 'spotify'
cask 'bitwarden'

# VS Code Extensions
vscode "github.copilot"
vscode "eamodio.gitlens"

# Fonts
cask 'font-meslo-for-powerlevel10k'
